<%@ page language="java" import="java.util.*,java.text.*"
	pageEncoding="utf-8"%>
<%-- JSP基本代码用法
	
	 1.JSP中写JAVA代码，用<%%>隔开，在_jspService()方法中被直接翻译成java代码
	 2.输出变量
	 3.穿插html代码
	 4.全局声明(类的属性和方法)，用感叹号写
	 5.JSP注释和html注释
 --%>
<html>
	<head>
		<title>JSP基本代码用法</title>
	</head>
	<body>
		<!-- ******************************************************************************************** -->
		<!-- 1.JSP中写JAVA代码，用<%%>隔开，在_jspService()方法中被直接翻译成java代码 -->
		<%
	    	//获取当前时间(需要导入text包)
	    	SimpleDateFormat sdf = new SimpleDateFormat();
	    	String curDate = sdf.format(new Date());
	    	//输出内容到浏览器
	    	//response.getWriter().write("");
	    	out.write("当前时间为2："+curDate);
			//定义变量
	  		String name = "eric";//在_jspService()方法中直接翻译
	  		int a = 10;
	  	%>
	
		<!-- ******************************************************************************************** -->
		<!-- 2.输出变量 -->
		<%=name%><!-- 被翻译成：out.print(name);jsp中等于后面的内柔为java代码中括号里的内容 -->
	
		<!-- ******************************************************************************************** -->
		<!-- 3.穿插html代码 -->
		<%
	  	 	for(int i=1;i<=6;i++){ 	
	  	  %>
		<h <%=i %>>程序循环输出6个中定义的标题</h<%=i %>>
		<%
	  	  }
	  	  %>
	
		<!-- ******************************************************************************************** -->
		<!-- 4.全局声明(类的属性和方法)，用感叹号写 -->
		<%!
	  	   //变量
	  	  	String name = "jacky";
	  	  	public String getName(){
	  	  		return name;
	  	  	}
	  	  	//public void _jspInit(){}//不能重复定义翻译好的一些方法
	  	   %>
	
		<!-- ******************************************************************************************** -->
		<!-- 5.JSP注释和html注释-->
		<%-- 注释，和html注释不同，jsp注释不会写入到页面中 --%>
	</body>
</html>
